In [43]:
import pandas as pd
import numpy as np

What is the difference between a Python list and a Pandas Series?
i don't know 

series = pd.Series([1,2,3],index=['a','b','c'])

print(series)

In [44]:
# creating a series form a list

series = pd.Series([1,2,3],index=['a','b','c'])

print(series)

a    1
b    2
c    3
dtype: int64

❓ Question 2:
In row 1, is "None" considered missing data? Why or why not?
no because is a string , to consider missing data it must be None

In [45]:
my_dict={
    "name":['Alice',"None",None,"Abdelfattah" , None ],
    "Age":[24,15,34,23,23],
    "city": ["cairo", "alex" , None , "cairo" , "cairo"]
}

dataFrame =pd.DataFrame(my_dict , index=[1,2,3,4,5])

dataFrame

          name  Age   city
1        Alice   24  cairo
2         None   15   alex
3         None   34   None
4  Abdelfattah   23  cairo
5         None   23  cairo

❓ Question 3:
What does .T do in df.describe().T?

to make transofromation

In [46]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     5 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 160.0+ bytes

In [47]:
dataFrame.head()

          name  Age   city
1        Alice   24  cairo
2         None   15   alex
3         None   34   None
4  Abdelfattah   23  cairo
5         None   23  cairo

In [48]:
dataFrame.tail()

          name  Age   city
1        Alice   24  cairo
2         None   15   alex
3         None   34   None
4  Abdelfattah   23  cairo
5         None   23  cairo

In [49]:
dataFrame.describe()

             Age
count   5.000000
mean   23.800000
std     6.760178
min    15.000000
25%    23.000000
50%    23.000000
75%    24.000000
max    34.000000

In [50]:
dataFrame.describe().T

     count  mean       std   min   25%   50%   75%   max
Age    5.0  23.8  6.760178  15.0  23.0  23.0  24.0  34.0

In [51]:
dataFrame.describe(include='all').T

     count unique    top freq  mean       std   min   25%   50%   75%   max
name     3      3  Alice    1   NaN       NaN   NaN   NaN   NaN   NaN   NaN
Age    5.0    NaN    NaN  NaN  23.8  6.760178  15.0  23.0  23.0  24.0  34.0
city     4      2  cairo    3   NaN       NaN   NaN   NaN   NaN   NaN   NaN

sk 2:
What method would you use to find:

How many non-null values each column has?
=> dataframe.info()
The mean, min, max of numerical columns?
=> dataframe.descripe();

In [52]:
#retrun data frame
dataFrame[['Age','city']]

   Age   city
1   24  cairo
2   15   alex
3   34   None
4   23  cairo
5   23  cairo

In [53]:
#filtering rows 
# age >=15
dataFrame[dataFrame['Age']<=15]

   name  Age  city
2  None   15  alex

In [54]:
dataFrame[dataFrame['city'] == 'cairo']

          name  Age   city
1        Alice   24  cairo
4  Abdelfattah   23  cairo
5         None   23  cairo

In [55]:
# loc - Label-based selection
# Rows 0-2, specific columns


dataFrame.loc[0:2, ['Age','city']]

   Age   city
1   24  cairo
2   15   alex

❓ Question 4:
What's the difference between:

df['Age']
df[['Age']]

nothing, two are same


✏️ Task 3:
Write code to filter rows where Age > 20 AND city == 'cairo'

In [56]:
dataFrame[dataFrame['Age']>20]

dataFrame[dataFrame['city'] == 'cairo']

          name  Age   city
1        Alice   24  cairo
4  Abdelfattah   23  cairo
5         None   23  cairo

In [57]:
## Adding a column

dataFrame['Salary']=[1000,2000,3000,4000,5000]

dataFrame

          name  Age   city  Salary
1        Alice   24  cairo    1000
2         None   15   alex    2000
3         None   34   None    3000
4  Abdelfattah   23  cairo    4000
5         None   23  cairo    5000

In [58]:
# Dropping column (returns new df, original unchanged)
new_df = dataFrame.drop('Salary',axis=1)

new_df

          name  Age   city
1        Alice   24  cairo
2         None   15   alex
3         None   34   None
4  Abdelfattah   23  cairo
5         None   23  cairo

In [59]:
dataFrame

          name  Age   city  Salary
1        Alice   24  cairo    1000
2         None   15   alex    2000
3         None   34   None    3000
4  Abdelfattah   23  cairo    4000
5         None   23  cairo    5000

In [62]:
# Dropping with inplace (modifies original)
dataFrame.drop(4,axis=0,inplace=True)

dataFrame

   name  Age   city  Salary
2  None   15   alex    2000
3  None   34   None    3000
5  None   23  cairo    5000

In [ ]:
# Reset index after dropping rows

In [63]:
dataFrame.reset_index()

   index  name  Age   city  Salary
0      2  None   15   alex    2000
1      3  None   34   None    3000
2      5  None   23  cairo    5000

Why is df unchanged after df.drop('Salary', axis=1) without inplace=True?
because df.drop return new df without modification the orignal df , if we need to modified the orignal we need to put inplace=Ture

✏️ Task 4:
How would you add a new column called 'Bonus' that equals 10% of Salary?

In [64]:
dataFrame['Bonus'] = dataFrame['Salary']*1.1

dataFrame

   name  Age   city  Salary   Bonus
2  None   15   alex    2000  2200.0
3  None   34   None    3000  3300.0
5  None   23  cairo    5000  5500.0

In [66]:
# Check missing values
dataFrame.isnull().sum()

name      2
Age       0
city      1
Salary    0
Bonus     0
dtype: int64

In [67]:
dataFrame['city'].fillna(dataFrame['city'].mode()[0],inplace=True)

dataFrame

   name  Age   city  Salary   Bonus
2  None   15   alex    2000  2200.0
3  None   34   alex    3000  3300.0
5  None   23  cairo    5000  5500.0

In [68]:
dataFrame.isnull().sum()

name      2
Age       0
city      0
Salary    0
Bonus     0
dtype: int64

In [71]:
dataFrame['Age'].fillna(dataFrame['Age'].mean(),inplace=True)
dataFrame

/tmp/ipykernel_65151/1927055020.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataFrame['Age'].fillna(dataFrame['Age'].mean(),inplace=True)

   name  Age   city  Salary   Bonus
2  None   15   alex    2000  2200.0
3  None   34   alex    3000  3300.0
5  None   23  cairo    5000  5500.0

In [72]:
# Drop rows with ANY missing value
dataFrame.dropna()

dataFrame

   name  Age   city  Salary   Bonus
2  None   15   alex    2000  2200.0
3  None   34   alex    3000  3300.0
5  None   23  cairo    5000  5500.0

❓ Question 6:
Why do we use mode()[0] instead of just mode()?
i don't know

In [74]:
x = dataFrame.groupby('city')['Age'].mean()

x

city
alex     24.5
cairo    23.0
Name: Age, dtype: float64

In [79]:
x = dataFrame.groupby('city')['Salary'].max()
x

city
alex     3000
cairo    5000
Name: Salary, dtype: int64

In [80]:
x= dataFrame.groupby('city').agg({'Salary': 'mean','Age':'max'})
x

       Salary  Age
city
alex   2500.0   34
cairo  5000.0   23

What will df.groupby('city')['Salary'].sum() return?

sum of salary in each city

✏️ Task 6:
Write code to find the maximum salary in each city.

In [81]:
x = dataFrame.groupby('city')['Salary'].max()

x

city
alex     3000
cairo    5000
Name: Salary, dtype: int64

In [82]:
#apply function

def double_salar(x):
    return x * 2

dataFrame['DoubleSalary'] = dataFrame['Salary'].apply(double_salar)

dataFrame

   name  Age   city  Salary   Bonus  DoubleSalary
2  None   15   alex    2000  2200.0          4000
3  None   34   alex    3000  3300.0          6000
5  None   23  cairo    5000  5500.0         10000

In [84]:
# With lambda (shorter)
dataFrame['DoubleSalary'] = dataFrame['Salary'].apply(lambda x:x * 3)
dataFrame

   name  Age   city  Salary   Bonus  DoubleSalary
2  None   15   alex    2000  2200.0          6000
3  None   34   alex    3000  3300.0          9000
5  None   23  cairo    5000  5500.0         15000

❓ Question 8:
Rewrite double_salary function as a lambda expression.

func(x)= lambda x : x *2

In [85]:
func= lambda x : x *2 

func(223)

446

✏️ Task 7:
Create a function that categorizes Age:

Age < 20: "Young"
Age 20-30: "Adult"
Age > 30: "Senior"
Apply it to create a new column 'Age_Category'

In [86]:
def categorizes_Age(x):
    if x<20:
        return "Young"
    elif x <= 30:
        return "Adult"
    else:
        return "Senior"
    
dataFrame['Age_Category'] = dataFrame['Age'].apply(categorizes_Age)

dataFrame

   name  Age   city  Salary   Bonus  DoubleSalary Age_Category
2  None   15   alex    2000  2200.0          6000        Young
3  None   34   alex    3000  3300.0          9000       Senior
5  None   23  cairo    5000  5500.0         15000        Adult

In [87]:
data = pd.read_csv("employees.csv")

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 608.0+ bytes

In [88]:
data.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [89]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,10.0,5.5,3.027650,1.0,3.25,5.5,7.75,10.0
Age,10.0,35.3,7.958922,26.0,29.25,33.0,40.25,50.0
Salary,10.0,68300.0,13106.826042,50000.0,57250.00,69000.0,74250.00,90000.0

 Question 9:
You receive a new CSV file. What are the FIRST 3 things you should do to understand the data?
data.info()
data.head()
data.describe().T

In [ ]:
#📖 PART 10: Sorting & Value Counts
# Sort by Age descending
sorted_data = data.sort_values('Age' ,ascending=False)

sorted_data

   ID           Name Department  Age  Salary Joining_Date
6   7     Mike Davis    Finance   50   90000   2016-08-19
2   3    Bob Johnson    Finance   45   85000   2018-07-15
5   6      Eva Green         HR   41   54000   2017-04-22
8   9   James Wilson  Marketing   38   70000   2020-09-08
1   2     Jane Smith         IT   34   75000   2019-06-12
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
9  10    Sarah Adams         HR   30   55000   2021-03-18
3   4    Alice White         IT   29   72000   2021-01-04
0   1       John Doe         HR   28   50000   2020-05-21
7   8   Linda Taylor         IT   26   64000   2022-02-10

In [94]:
# Count occurrences
data['Department'].value_counts()

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [102]:
#Write code to sort employees by Salary (highest first), then by Age (youngest first) if salaries are equal.

sorted_data = data.sort_values('Salary',ascending=False)

sorted_data

   ID           Name Department  Age  Salary Joining_Date
6   7     Mike Davis    Finance   50   90000   2016-08-19
2   3    Bob Johnson    Finance   45   85000   2018-07-15
1   2     Jane Smith         IT   34   75000   2019-06-12
3   4    Alice White         IT   29   72000   2021-01-04
8   9   James Wilson  Marketing   38   70000   2020-09-08
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
7   8   Linda Taylor         IT   26   64000   2022-02-10
9  10    Sarah Adams         HR   30   55000   2021-03-18
5   6      Eva Green         HR   41   54000   2017-04-22
0   1       John Doe         HR   28   50000   2020-05-21

In [104]:
data['Joining_Date'] = pd.to_datetime(data['Joining_Date'])

data

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [106]:
x = data[data['Joining_Date'] > "2020-01-01"]
x

   ID          Name Department  Age  Salary Joining_Date
0   1      John Doe         HR   28   50000   2020-05-21
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10
8   9  James Wilson  Marketing   38   70000   2020-09-08
9  10   Sarah Adams         HR   30   55000   2021-03-18

❓ Question 10:
Why do we need to convert dates using pd.to_datetime()? Why not keep them as strings?

i don't know

In [107]:
data.to_csv("studyData.csv")

In [110]:
# Write code to filter: Salary > 2000 OR Age < 25

x =dataFrame[(dataFrame['Salary'] > 2000) | (dataFrame['Age'] < 25)]

x

   name  Age   city  Salary   Bonus  DoubleSalary Age_Category
2  None   15   alex    2000  2200.0          6000        Young
3  None   34   alex    3000  3300.0          9000       Senior
5  None   23  cairo    5000  5500.0         15000        Adult

In [112]:
# Create a 'Tax' column that is 15% of Salary (not 115%!)
dataFrame['Tax'] = dataFrame['Salary']*.15

dataFrame

   name  Age   city  Salary   Bonus  DoubleSalary Age_Category    Tax
2  None   15   alex    2000  2200.0          6000        Young  300.0
3  None   34   alex    3000  3300.0          9000       Senior  450.0
5  None   23  cairo    5000  5500.0         15000        Adult  750.0

In [113]:
# Sort by Department (A-Z), then Salary (highest first)
data_sorted = data.sort_values(['Department','Salary'],ascending=[False,True])

data_sorted

   ID           Name Department  Age  Salary Joining_Date
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
8   9   James Wilson  Marketing   38   70000   2020-09-08
7   8   Linda Taylor         IT   26   64000   2022-02-10
3   4    Alice White         IT   29   72000   2021-01-04
1   2     Jane Smith         IT   34   75000   2019-06-12
0   1       John Doe         HR   28   50000   2020-05-21
5   6      Eva Green         HR   41   54000   2017-04-22
9  10    Sarah Adams         HR   30   55000   2021-03-18
2   3    Bob Johnson    Finance   45   85000   2018-07-15
6   7     Mike Davis    Finance   50   90000   2016-08-19